static void Main(string[] args)
{
    Console.WriteLine();
    Console.WriteLine("Задача 19");
    //Напишите метод, который принимает на вход пятизначное число
    //и проверяет, является ли оно палиндромом.

}